package space.mosk.checkbrain;

public class Array {
    public int[] images_math1 = {R.drawable.firstlevel_zero, R.drawable.firstlevel_one, R.drawable.firstlevel_two, R.drawable.firstlevel_three, R.drawable.firstlevel_four, R.drawable.firstlevel_five, R.drawable.firstlevel_six, R.drawable.firstlevel_seven, R.drawable.firstlevel_eight, R.drawable.firstlevel_nine};
    public String[] texts1 = {"Ноль", "Один", "Два", "Три", "Четыре", "Пять", "Шесть", "Семь", "Восемь", "Девять"};

    public int[] images_planets1 = {R.drawable.merk, R.drawable.venera, R.drawable.zemlya, R.drawable.mars, R.drawable.upiter, R.drawable.saturn, R.drawable.uran, R.drawable.neptun};
    public String[] text_planets = {"Меркурий", "Венера", "Земля", "Марс", "Юпитер", "Сатурн", "Уран", "Нептун"};

    public String[] europe = {"Нидерланды", "Греция", "Сербия", "Германия", "Россия", "Швеция", "Польша", "Финлядния", "Испания", "Бельгия", "Австрия", "Хорватия", "Украина", "Дания", "Португалия", "Великобритания", "Белоруссия", "Франция", "Чехия", "Италия", "Эстония", "Болгария"};

    public String[] europeAnswer = {"Амстердам", "Афины", "Белград", "Берлин", "Москва", "Стокгольм", "Варшава", "Хельсинки", "Мадрид", "Брюссель", "Вена", "Загреб", "Киев", "Копенгаген", "Лиссабон", "Лондон", "Минск", "Париж", "Прага", "Рим", "Таллин", "София"};

    public String[] asia = {"Турция", "Ирак", "ОАЭ", "Ливан", "Сирия", "Индия", "Япония", "Китай", "Грузия", "КНДР", "Азербайджан", "Киргизия", "Кипр", "Иран", "Вьетнам", "Сингапур", "Армения", "Таиланд", "Абхазия", "Саудовская Аравия", "Республика Корея", "Афганистан"};
    public String[] asiaAnswer = {"Анкара", "Багдад", "Абу-Даби", "Бейрут", "Дамаск", "Дели", "Токио", "Пекин", "Тбилиси", "Пхеньян", "Баку", "Бишкек", "Никосия", "Тегеран", "Ханой", "Сингапур", "Ереван", "Бангкок", "Сухум", "Эр-Рияд", "Сеул", "Кабул"};

    public String[] africa = {"Нигерия", "Эфиопия", "Алжир", "Судан", "Камерун", "Тунис", "Марокко", "Нигер", "Уганда", "Египет", "Гамбия", "Гана", "Мадагаскар", "Мали", "Республика Конго", "Сенегал", "Танзания", "Гвинея", "Замбия", "Кения", "ЮАР", "Сомали"};
    public String[] africaAnswer = {"Абуджа", "Аддис-Абеба", "Ажир", "Хартум", "Яунде", "Тунис", "Рабат", "Ниамей", "Кампала", "Каир", "Банжул", "Аккра", "Антананариву", "Бамако", "Браззавиль", "Дакар", "Додома", "Габон", "Лусака", "Найроби", "Претория", "Могадишо"};

    public String[] america = {"США", "Канада", "Мексика", "Аргентина", "Бразилия", "Колумбия", "Чили", "Уругвай", "Панама", "Эквадор", "Коста-Рика", "Парагвай", "Куба", "Венесуэла", "Ямайка", "Перу", "Доминика", "Никарагуа", "Багамские Острова", "Суринам", "Боливия", "Гаити"};
    public String[] americaAnswer = {"Вашингтон", "Оттава", "Мехико", "Буэнос-Айрес", "Бразилиа", "Богота", "Сантьяго", "Монтевидео", "Панама", "Кито", "Сан-Хосе", "Асунсьон", "Гавана", "Каракас", "Кингстон", "Лима", "Розо", "Манагуа", "Нассау", "Парамарибо", "Сукре", "Порт-о-Пренс"};

    public String[] australia = {"Самоа", "Новая Зеландия", "Фиджи", "Австралия", "Тонга", "Палау", "Тувалу", "Соломоновы острова", "Микронезия", "Маршалловы острова", "Кирибати"};
    public String[] australiaAnswer = {"Апиа", "Веллингтон", "Сува", "Канберра", "Нукуалофа", "Нгерулмуд", "Фунафути", "Хониара", "Паликир", "Маджуро", "Баирики"};

    public String[] popular = {"Германия", "Россия", "Испания", "Великобритания", "Италия", "Япония", "Китай", "Египет", "Аргентина", "Бразилия", "Швеция", "Польша", "Финлядния", "Чехия" , "Эстония" , "Турция" , "Индия" , "Кипр" , "КНДР" , "США" , "Австралия" , "Новая Зеландия"};
    public String[] popularAnswer = {"Берлин", "Москва", "Мадрид", "Лондон", "Рим", "Токио", "Пекин", "Каир", "Буэнос-Айрес", "Бразилиа", "Стокгольм", "Варшава", "Хельсинки", "Прага" , "Таллин" , "Анкара" , "Дели" , "Никосия" , "Пхеньян" , "Вашингтон" , "Канберра" , "Веллингтон"};

    public String[] choose_true1 = {
            "Левое полушарие мозга отвечает за логику, а правое — за творчество",
            "Земля — круглая",
            "Эверест — самая высокая гора в мире",
            "Банан — это ягода, а клубника — нет",
            "Большая часть бытового мусора на планете — это пластик",
            "У рыб отсутствует долгосрочная память",
            "Алкоголь вреден для мозга",
            "Бумажный пакет — экологичнее, чем пластиковый",
            "Акулы существовали на Земле еще до деревьев",
            "Нарния — это выдумка",
    };
    public String[] choose_true2 = {
            "Стеклянные бутылки разлагаются дольше пластиковых",
            "Дельфинов тренируют для выполнения боевых задач",
            "Человек может сам себя пощекотать",
            "Хлопок — максимально экологичный материал",
            "Электробусы менее экологичны, чем дизельные автобусы",
            "Правда ли, что черепахи умеют плакать?",
            "Является ли шакал родственником собаки?",
            "Первые машины имели два колеса?",
            "Верно ли, что все блины надо делать из ржаной муки?",
            "Правда, что крокодил может бревном притвориться, чтоб спастись от врага?",
    };
    public String[] choose_true3 = {
            "Самый большой материк – это Евразия?",
            "Верно ли утверждение, что запасов пресной воды на планете меньше, чем соленой?",
            "Ближайшая к Солнцу планета – Марс?",
            "Правда, что для того, чтобы произвести стекло, нужно использовать глину?",
            "Правда, что, если божью коровку рассердить, она начинает больно кусаться?",
            "Верно ли утверждение, что изобретателями бумаги являются китайцы?",
            "Правда, что ножовкой можно пилить?",
            "Верно ли утверждение, что русский алфавит имеет десять гласных звуков?",
            "Правда, что белые медведи во время охоты закрывают лапой нос, чтобы их не заметила жертва?",
            "Археологи – это люди, которые изучают прошлое человечества?"
    };
    public String[] choose_true4 = {
            "Верно ли утверждение, что у человека есть среднее ухо?",
            "Правда, что если смешать красный и зеленый, то получится коричневый?",
            "Правда, что в шахматной партии ферзь важнее королевы?",
            "Правда, что в некоторых странах светлячков используют для освещения?",
            "Глаз наполнен воздухом",
            "В Австралии применяют одноразовые школьные доски",
            "Чем человек старше, тем быстрее летит время",
            "Правда, что японские школьники пишут на доске кистью и цветными чернилами?",
            "Летучие мыши умеют принимать радиосигналы",
            "Древние Римляне предсказали появление телефона"
    };
    public String[] choose_true5 = {
            "Паук может питаться своей паутиной",
            "В Африке выпускают карандаши с витаминами для детей, которые привыкли все грызть",
            "Правда, что шариковая ручка в начале была в применении только у военных летчиков?",
            "Правда, что в Олимпиаде в Древней Греции могли принимать участие только рабы?",
            "Макдональдс продаёт больше всего игрушек в мире",
            "Изюм запрещён в Судане",
            "Летающие лягушки существуют?",
            "Правда, что самое большое количество репы выращивается в России?",
            "Фагот – это духовой инструмент?",
            "Верно ли выражение «большая половина весны оказалась дождливой»?"
    };
    public  boolean[] chooseTrueAns1 = {false, false, false, true, false, false, true, false, true, false } ;
    public  boolean[] chooseTrueAns2 = {true, true, false, false, true, true, true, false, false, false};
    public  boolean[] chooseTrueAns3 = {true, true, false, false, false, true, true, false, false, true};
    public  boolean[] chooseTrueAns4 = {true, true, false, true, false, false, true, true, false, false};
    public  boolean[] chooseTrueAns5 = {true, true, true, false, true, false, true, false, true, false};

    public String[] dates1Ans = {"610 г.", "962 г.", "1265 г.", "1337−1453 гг.", "1453 г.", "1492 г.", "1519−1522 гг.", "1569 г.", "1618−1648 гг. ", "1776 г", "1789 г.", "1804 г.", "1799−1815 гг.", "1861−1865 гг.", "1914−1918 гг.", "1922 г. ", "1939−1945 гг.", "6, 9 августа 1945 г.", "1949 г.", "1990 "};
    public String[] dates1= {"возникновение ислама", "образование Священной Римской империи", "возникновение Английского парламента", "Столетняя война", "падение Византийской империи", "открытие Америки Христофором Колумбом", "кругосветное плавание экспедиции Ф. Магеллана", "образование Речи Посполитой", "Тридцатилетняя война", "принятие Декларации независимости США", "принятие Декларации прав человека и гражданина", "провозглашение Наполеона императором Франции", "Наполеоновские войны", "Гражданская война в США", "Первая мировая война", "приход фашистов к власти в Италии", "Вторая мировая война", "атомная бомбардировка США Хиросимы и Нагасаки", "образование HATО", "объединение ГДР и ФРГ"};

    public String[] dates2Ans = {"988 г.", "1243 г.", "1240 г", "1242 г., 5 апреля", "1380 г., 8 сентября", "1565–1572 гг", "1605–1606 гг", "1607–1610 гг.", "1648 г.", "1700–1721 гг. ", "1703 г., 16 мая.", "1756–1763 гг.", "1773–1775 гг.", "1851 г.", "1861 г., 19 февраля", "1917 г., февраль", "1922 г., 30 декабря", "1941 г., 22 июня – 1945 г., 9 мая", "1991 г., 8 декабря", "2002 г."};
    public String[] dates2 = {"Принятие христианства на Руси.", "Образование государства Золотая Орда", "Невская битва.", "Ледовое побоище.", "Куликовская битва.", "Опричнина Ивана IV Грозного", "Правление Лжедмитрия I.", "Попытка Лжедмитрия II захватить власть в России", "«Соляной бунт» в Москве.", "Северная война.", "Основание Санкт Петербурга.", "Семилетняя война.", "Крестьянская война под предводительством Емельяна Пугачева.", "Открытие железной дороги Москва – Санкт-Петербург.", "Отмена крепостного права в России.", "Февральская буржуазно демократическая революция в России.", "Образование СССР.", "Великая Отечественная война.", "Беловежские соглашение о роспуске СССР и создание СНГ.", "Избрание В.В. Путина Президентом РФ."};

    public String[] person1 = {"пророк ислама", "физик, математик, механик и астроном",
            "мессия, основатель христианства", "Конфуций", "мореплаватель, один из открывателей Америки",
            "физик-теоретик", "физик, механик, астроном, философ и математик",
            "философ, основоположник формальной логики", "математик, «отец геометрии»", "основоположник иудаизма",
            "римский император, с которым ассоциируется «золотой век» римской культуры",
            "первый президент Соединённых Штатов Америки", "философ, социолог, экономист. Основатель марксизма",
            "основатель и первый великий хан Монгольской империи",
            "экономист, философ-этик; один из основоположников современной экономической теории",
            "полководец, создатель Македонской империи", "полководец, император Франции", "фюрер Германии",
            "учёный, изобретатель и бизнесмен, один из основоположников телефонии",
            "композитор и пианист, представитель «венской классической школы»",
            "скульптор, живописец, архитектор, поэт, мыслитель. Один из величайших мастеров эпохи Ренессанса",
            "физик. Известен как «отец» ядерной физики, создал планетарную модель атома", "руководитель СССР",
            "диктатор Римской республики, значительно расширивший её влияние и территорию",
            "композитор, представитель эпохи барокко, органист-виртуоз",
            "революционер, основоположник марксизма-ленинизма, основатель СССР",
            "первый Император Всероссийский, развернул масштабные реформы российского государства",
            "последний генеральный секретарь ЦК КПСС, первый и последний Президент СССР"};
    public String[] person1Ans = {"Мухаммед", "Исаак Ньютон", "Иисус Христос", "Конфуций", "Христофор Колумб",
            "Альберт Эйнштейн", "Галилей, Галилео", "Аристотель", "Евклид", "Моисей", "Октавиан Август",
            "Джордж Вашингтон", "Карл Маркс", "Чингисхан", "Адам Смит", "Александр Македонский", "Наполеон I",
            "Адольф Гитлер", "Александр Белл", "Людвиг ван Бетховен", "Микеланджело", "Эрнест Резерфорд",
            "Иосиф Сталин", "Юлий Цезарь", "Иоганн Бах", "Владимир Ленин", "Пётр I", "Михаил Горбачёв"};
    public String[] person2Ans = {"Стив Джобс", "Генри Форд", "Джон Дэвисон Рокфеллер", "Э́ндрю Ка́рнеги",
            "Уо́лтер Эла́йас Дисней", "Томас Кук", "Томас Эдисон", "Айзек Зингер", "Гуччио Гуччи",
            "Коко Шанель", "Мартин Купер", "Энцо Феррари", "Билл Гейтс", "Джорджо Армани", "Фил Найт",
            "Павел Дуров", "Сэм Уолтон", "Безос, Джефф", "Марк Цукерберг", "Илон Маск"};
    public String[] person2 = {"американский предприниматель, получивший широкое признание в качестве пионера эры IT-технологий",
            "американский промышленник, владелец заводов по производству автомобилей по всему миру, изобретатель, автор 161 патента США",
            "американский предприниматель, филантроп, первый долларовый миллиардер в истории человечества. В 1870 году основал компанию Standard Oil",
            "американский предприниматель, крупный сталепромышленник, мультимиллионер и филантроп",
            "американский художник-мультипликатор, кинорежиссёр, актёр, сценарист и продюсер",
            "британский предприниматель. Прославился тем, что изобрёл организованный туризм и в 1841 году открыл первое в истории туристическое агентство",
            "изобретатель и предприниматель",
            "американский изобретатель и промышленник. Внёс существенный вклад в усовершенствование конструкции швейной машины",
            "Модельер, основатель дома моды Gucci",
            "французский модельер, основавшая модный дом Chanel и оказавшая существенное влияние на европейскую моду XX века",
            "американский инженер и физик, известен как человек, совершивший первый звонок по сотовому телефону",
            "итальянский конструктор, предприниматель и автогонщик. Основатель автомобилестроительной компании «Феррари» и одноимённой автогоночной команды",
            "американский предприниматель и общественный деятель, филантроп, один из создателей компании Microsoft",
            "итальянский модельер и предприниматель, основатель компании Armani, один из богатейших людей Италии",
            "американский бизнесмен, один из основателей компании Nike",
            "российский предприниматель, программист, долларовый миллиардер, один из создателей социальной сети «ВКонтакте»",
            "американский бизнесмен, основатель сетей магазинов Wal-Mart и Sam's Club",
            "американский предприниматель, основатель и глава интернет-компании Amazon.com",
            "американский программист, предприниматель в области интернет-технологий, долларовый миллиардер, филантроп",
            "американский предприниматель, инженер и миллиардер, основатель, совладелец, генеральный директор и главный инженер[5] компании SpaceX"};
}
