package space.mosk.checkbrain;

public class Array {
    public int[] images_math1 = {R.drawable.firstlevel_zero, R.drawable.firstlevel_one, R.drawable.firstlevel_two, R.drawable.firstlevel_three, R.drawable.firstlevel_four, R.drawable.firstlevel_five, R.drawable.firstlevel_six, R.drawable.firstlevel_seven, R.drawable.firstlevel_eight, R.drawable.firstlevel_nine};
    public String[] texts1 = {"Ноль", "Один", "Два", "Три", "Четыре", "Пять", "Шесть", "Семь", "Восемь", "Девять"};



    public String[] europe = {"Нидерланды", "Греция", "Сербия", "Германия", "Россия", "Швеция", "Польша", "Финлядния", "Испания", "Бельгия", "Австрия", "Хорватия", "Украина", "Дания", "Португалия", "Великобритания", "Белоруссия", "Франция", "Чехия", "Италия", "Эстония", "Болгария"};

    public String[] europeAnswer = {"Амстердам", "Афины", "Белград", "Берлин", "Москва", "Стокгольм", "Варшава", "Хельсинки", "Мадрид", "Брюссель", "Вена", "Загреб", "Киев", "Копенгаген", "Лиссабон", "Лондон", "Минск", "Париж", "Прага", "Рим", "Таллин", "София"};

    public String[] asia = {"Турция", "Ирак", "ОАЭ", "Ливан", "Сирия", "Индия", "Япония", "Китай", "Грузия", "КНДР", "Азербайджан", "Киргизия", "Кипр", "Иран", "Вьетнам", "Сингапур", "Армения", "Таиланд"};
    public String[] asiaAnswer = {"Анкара", "Багдад", "Абу-Даби", "Бейрут", "Дамаск", "Дели", "Токио", "Пекин", "Тбилиси", "Пхеньян", "Баку", "Бишкек", "Никосия", "Тегеран", "Ханой", "Сингапур", "Ереван", "Бангкок"};

    public String[] africa = {"Нигерия", "Эфиопия", "Алжир", "Судан", "Камерун", "Тунис", "Марокко", "Нигер", "Уганда", "Египет", "Гамбия"};
    public String[] africaAnswer = {"Абуджа", "Аддис-Абеба", "Ажир", "Хартум", "Яунде", "Тунис", "Рабат", "Ниамей", "Кампала", "Каир", "Банжул"};

    public String[] america = {"США", "Канада", "Мексика", "Аргентина", "Бразилия", "Колумбия", "Чили", "Уругвай", "Панама", "Эквадор", "Коста-Рика"};
    public String[] americaAnswer = {"Вашингтон", "Оттава", "Мехико", "Буэнос-Айрес", "Бразилиа", "Богота", "Сантьяго", "Монтевидео", "Панама", "Кито", "Сан-Хосе"};

    public String[] australia = {"Самоа", "Новая Зеландия", "Фиджи", "Австралия", "Тонга", "Палау", "Тувалу", "Соломоновы острова", "Микронезия", "Маршалловы острова", "Кирибати"};
    public String[] australiaAnswer = {"Апиа", "Веллингтон", "Сува", "Канберра", "Нукуалофа", "Нгерулмуд", "Фунафути", "Хониара", "Паликир", "Маджуро", "Баирики"};

    public String[] popular = {"Германия", "Россия", "Испания", "Великобритания", "Италия", "Япония", "Китай", "Египет", "Аргентина", "Бразилия", "Швеция", "Польша", "Финлядния"};
    public String[] popularAnswer = {"Берлин", "Москва", "Мадрид", "Лондон", "Рим", "Токио", "Пекин", "Каир", "Буэнос-Айрес", "Бразилиа", "Стокгольм", "Варшава", "Хельсинки"};

    public String[] choose_true1 = {
            "Левое полушарие мозга отвечает за логику, а правое — за творчество",
            "Земля — круглая",
            "Эверест — самая высокая гора в мире",
            "Банан — это ягода, а клубника — нет",
            "Большая часть бытового мусора на планете — это пластик",
            "У рыб отсутствует долгосрочная память",
            "Алкоголь вреден для мозга",
            "Бумажный пакет — экологичнее, чем пластиковый",
            "Акулы существовали на Земле еще до деревьев",
            "Нарния — это выдумка",
    };
    public String[] choose_true2 = {
            "Стеклянные бутылки разлагаются дольше пластиковых",
            "Дельфинов тренируют для выполнения боевых задач",
            "Человек может сам себя пощекотать",
            "Хлопок — максимально экологичный материал",
            "Электробусы менее экологичны, чем дизельные автобусы",
            "Правда ли, что черепахи умеют плакать?",
            "Является ли шакал родственником собаки?",
            "Первые машины имели два колеса?",
            "Верно ли, что все блины надо делать из ржаной муки?",
            "Правда, что крокодил может бревном притвориться, чтоб спастись от врага?",
    };
    public String[] choose_true3 = {
            "Самый большой материк – это Евразия?",
            "Верно ли утверждение, что запасов пресной воды на планете меньше, чем соленой?",
            "Ближайшая к Солнцу планета – Марс?",
            "Правда, что для того, чтобы произвести стекло, нужно использовать глину?",
            "Правда, что, если божью коровку рассердить, она начинает больно кусаться?",
            "Верно ли утверждение, что изобретателями бумаги являются китайцы?",
            "Правда, что ножовкой можно пилить?",
            "Верно ли утверждение, что русский алфавит имеет десять гласных звуков?",
            "Правда, что белые медведи во время охоты закрывают лапой нос, чтобы их не заметила жертва?",
            "Археологи – это люди, которые изучают прошлое человечества?"
    };
    public String[] choose_true4 = {
            "Верно ли утверждение, что у человека есть среднее ухо?",
            "Правда, что если смешать красный и зеленый, то получится коричневый?",
            "Правда, что в шахматной партии ферзь важнее королевы?",
            "Правда, что в некоторых странах светлячков используют для освещения?",
            "Глаз наполнен воздухом",
            "В Австралии применяют одноразовые школьные доски",
            "Чем человек старше, тем быстрее летит время",
            "Правда, что японские школьники пишут на доске кистью и цветными чернилами?",
            "Летучие мыши умеют принимать радиосигналы",
            "Древние Римляне предсказали появление телефона"
    };
    public String[] choose_true5 = {
            "Паук может питаться своей паутиной",
            "В Африке выпускают карандаши с витаминами для детей, которые привыкли все грызть",
            "Правда, что шариковая ручка в начале была в применении только у военных летчиков?",
            "Правда, что в Олимпиаде в Древней Греции могли принимать участие только рабы?",
            "Макдональдс продаёт больше всего игрушек в мире",
            "Изюм запрещён в Судане",
            "Летающие лягушки существуют?",
            "Правда, что самое большое количество репы выращивается в России?",
            "Фагот – это духовой инструмент?",
            "Верно ли выражение «большая половина весны оказалась дождливой»?"
    };
    public  boolean[] chooseTrueAns1 = {false, false, false, true, false, false, true, false, true, false } ;
    public  boolean[] chooseTrueAns2 = {true, true, false, false, true, true, true, false, false, false};
    public  boolean[] chooseTrueAns3 = {true, true, false, false, false, true, true, false, false, true};
    public  boolean[] chooseTrueAns4 = {true, true, false, true, false, false, true, true, false, false};
    public  boolean[] chooseTrueAns5 = {true, true, true, false, true, false, true, false, true, false};
}
